# Docker-команда FROM вказує базовий образ контейнера
# Наш базовий образ - це Linux з попередньо встановленим python-3.10
FROM python:3.10

# Встановлюємо змінну середовища
ENV APP_HOME /main

# Встановлюємо робочу директорію всередині контейнера
WORKDIR /main

# Скопіюємо інші файли в робочу директорію контейнера
COPY . .

# Створюємо директорію для статики
RUN mkdir -p /main/static

# Встановимо залежності всередині контейнера
RUN pip install -r requirements.txt

# Позначимо порт, де працює застосунок всередині контейнера
EXPOSE 8000

# Запустимо наш застосунок всередині контейнера
ENTRYPOINT ["python", "main.py"]
